Revit 2027 API
CurveUV.Transform Method
 Transform this CurveUV by the given 2D affine transform if possible.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CurveUV Transform(
	Transform2D trfUV
)
Public Function Transform (
	trfUV As Transform2D
) As CurveUV
public:
CurveUV^ Transform(
	Transform2D^ trfUV
)
member Transform :
        trfUV : Transform2D -> CurveUV
Parameters
trfUV Transform2D
 The given 2D affine transform.
Return Value
CurveUV
 If successful a transformed CurveUV, otherwise null.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
CurveUV Class
Autodesk.Revit.DB Namespace